Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "dma.h"
#include "memorymap.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "FreeRTOS.h"
#include "task.h"
#include "stm32h7xx_nucleo.h"
#include "croutine.h"
#include "timerForDebug.h"
#include "iwdg.h"
#include "wwdg.h"
#include "delay.h"
#include "rtc_timeStamp.h"
#include "bootLoader.h"
#include "cpu_flash.h"
#include "stm32h7xx.h"
#include "event_groups.h"
#include <string.h>
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* 定义�?512KB AXI SRAM里面的变�? */
#pragma location = ".RAM_D1"  
uint32_t AXISRAMBuf[10];
#pragma location = ".RAM_D1"  
uint16_t AXISRAMCount;

/* 定义�?128KB SRAM1(0x30000000) + 128KB SRAM2(0x30020000) + 32KB SRAM3(0x30040000)里面的变�? */
#pragma location = ".RAM_D2" 
uint32_t D2SRAMBuf[10];
#pragma location = ".RAM_D2" 
uint16_t D2SRAMCount;

/* 定义�?64KB SRAM4(0x38000000)里面的变�? */
#pragma location = ".RAM_D3"  
uint32_t D3SRAMBuf[10];
#pragma location = ".RAM_D3"  
uint16_t D3SRAMCount;

#pragma location = ".RAM_BKP"
uint32_t BKPSRAMBuf[10];
#pragma location = ".RAM_BKP"
uint16_t BKPSRAMCount;

/* 
   1、将�?个扇区的空间预留出来做为参数区，这里是将�?2个扇区作为参数区�?
      默认情况下不要将�?1个扇区做参数区，因为�?1个扇区是默认的boot启动地址�?
   2、�?�过这种定义方式告诉编译器，此空间已经被占用，不让编译器再为这个空间编写程序�?
*/
#pragma location=0x08000000 + 128*1024
const uint8_t para_flash_area[128 * 1024];
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
extern IWDG_HandleTypeDef IwdgHandle;
extern WWDG_HandleTypeDef   WwdgHandle;
extern uint32_t wwdgDelayNum;
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
typedef struct
{
  uint8_t ParamVer;
  uint16_t ucBackLight;
  uint32_t Baud485;
  float ucRadioMode;
}PARAM_T;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void vTaskTaskUserIF(void *pvParameters);
static void vTaskLED(void *pvParameters);
static void vTaskMsgPro(void *pvParameters);
static void vTaskStart(void *pvParameters);
static void AppTaskCreate (void);
static void vTaskIwdg(void *pvParameters);
static void vTaskWwdg(void *pvParameters);
//static void vTaskRtcTimeStamp(void *pvParameters);

static TaskHandle_t xHandleTaskUserIF = NULL;
static TaskHandle_t xHandleTaskLED = NULL;
static TaskHandle_t xHandleTaskMsgPro = NULL;
static TaskHandle_t xHandleTaskStart = NULL;
static TaskHandle_t xHandleTaskIwdg = NULL;
static TaskHandle_t xHandleTaskWwdg = NULL;
//static TaskHandle_t xHandleTaskRtcTimeStamp = NULL;

EventGroupHandle_t xHandleEventGroup;

uint32_t UserButtonStatus = 0;  /* set to 1 after User Button interrupt  */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
static void AppObjCreate(void)
{
  /*创建事件标志组*/
  xHandleEventGroup = xEventGroupCreate();
  
  if(xHandleEventGroup == NULL)
  {
    /*事件标志组没有创建成功*/
    printf("xEventGroupCreate failed\r\n");
  }
}


/*
*********************************************************************************************************
* �? �? �?: vTaskTaskUserIF
* 功能说明: 接口消息处理，这里用�? LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 1 (数�?�越小优先级越低，这个跟 uCOS 相反)
*********************************************************************************************************
*/
static void vTaskTaskUserIF(void *pvParameters)
{
  
  uint8_t pcWriteBuffer[500];
  EventBits_t uxBits;
  //uint8_t buff[2048];
  
  while(1)
  {
    
    
    if(UserButtonStatus == 1)
    {
      //UserButtonStatus = 0;
      printf("============================================================\r\n");
      printf("TaskName TaskStatus Priority RemainStack TaskID\r\n");
      vTaskList((char *)pcWriteBuffer);
      printf("%s\r\n", pcWriteBuffer);
      
      printf("\r\nTaskName      RunCount       Usage\r\n");
      vTaskGetRunTimeStats((char *)pcWriteBuffer);
      printf("%s\r\n", pcWriteBuffer);
      
      RTC_CalendarShow();
      
      AXISRAMBuf[0] = AXISRAMCount++;
      AXISRAMBuf[5] = AXISRAMCount++;
      AXISRAMBuf[9] = AXISRAMCount++;
      printf("UserButtonStatus = 1, AXISRAMBuf[0] = %d, AXISRAMBuf[5] = %d, AXISRAMBuf[9] = %d\r\n",AXISRAMBuf[0], AXISRAMBuf[5], AXISRAMBuf[9]);
      
    }
    else if(UserButtonStatus == 2)
    {
      printf("UserButtonStatus = 2\r\ndelete led task\r\n");
      if(xHandleTaskLED != NULL)
      {
        vTaskDelete(xHandleTaskLED);
        xHandleTaskLED = NULL;
      }
      
      D2SRAMBuf[0] = D2SRAMCount++;
      D2SRAMBuf[5] = D2SRAMCount++;
      D2SRAMBuf[9] = D2SRAMCount++;
      printf("UserButtonStatus = 2, D2SRAMBuf[0] = %d, D2SRAMBuf[5] = %d, D2SRAMBuf[9] = %d\r\n",D2SRAMBuf[0], D2SRAMBuf[5], D2SRAMBuf[9]);
    }
    else if(UserButtonStatus == 3)
    {
      printf("UserButtonStatus = 3\r\ncreate led task\r\n");
      if(xHandleTaskLED == NULL)
      {
        xTaskCreate(  vTaskLED,
                        "vTaskLED",
                        512,
                        NULL,
                        2,
                        &xHandleTaskLED);
      }
      D3SRAMBuf[0] = D3SRAMCount++;
      D3SRAMBuf[5] = D3SRAMCount++;
      D3SRAMBuf[9] = D3SRAMCount++;
      printf("UserButtonStatus = 3, D3SRAMBuf[0] = %d, D3SRAMBuf[5] = %d, D3SRAMBuf[9] = %d\r\n",D3SRAMBuf[0], D3SRAMBuf[5], D3SRAMBuf[9]);
    }
    else if(UserButtonStatus == 4)
    {
      taskENTER_CRITICAL();
      printf("UserButtonStatus = 4\r\nsuspend led task\r\n");
      vTaskSuspend(xHandleTaskLED);
      BKPSRAMBuf[0] = BKPSRAMCount++;
      BKPSRAMBuf[5] = BKPSRAMCount++;
      BKPSRAMBuf[9] = BKPSRAMCount++;
      printf("UserButtonStatus = 3, BKPSRAMBuf[0] = %d, BKPSRAMBuf[5] = %d, BKPSRAMBuf[9] = %d\r\n",BKPSRAMBuf[0], BKPSRAMBuf[5], BKPSRAMBuf[9]);
      taskEXIT_CRITICAL();
      
