Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
    }
    else if(UserButtonStatus == 5)
    {
      printf("UserButtonStatus = 5\r\nresume led task\r\n");
      HAL_TIM_Base_Start_IT(&htim17);
      //vTaskResume(xHandleTaskLED);
    }
    else if(UserButtonStatus == 6)
    {
      /*
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_0);
      if((uxBits & SET_BIT_0) != 0)
      {
        printf("UserButtonStatus = 6, event group bit 0 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 6, event group bit 0 was not setted\r\n");
      }
      */
      //printf("UserButtonStatus = 6\r\nsuspend iwdg feed task\r\n");
      //vTaskSuspend(xHandleTaskIwdg);
    }
    else if(UserButtonStatus == 7)
    {
      /*
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_1);
      if((uxBits & SET_BIT_1) != 0)
      {
        printf("UserButtonStatus = 7, event group bit 1 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 7, event group bit 1 was not setted\r\n");
      }
      */
      vTaskResume(xHandleTaskStart);
      //printf("UserButtonStatus = 7\r\nresume iwdg feed task\r\n");
      //vTaskResume(xHandleTaskIwdg);
    }
    else if(UserButtonStatus == 8)
    {
      vTaskSuspendAll(); /*开启调度锁*/
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_0);
      if((uxBits & SET_BIT_0) != 0)
      {
        printf("UserButtonStatus = 8, event group bit 0 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 8, event group bit 0 was not setted\r\n");
      }
      uxBits = xEventGroupSetBits(xHandleEventGroup, SET_BIT_1);
      if((uxBits & SET_BIT_1) != 0)
      {
        printf("UserButtonStatus = 8, event group bit 1 was setted\r\n");
      }
      else
      {
        printf("UserButtonStatus = 8, event group bit 1 was not setted\r\n");
      }
      if(xTaskResumeAll() == pdTRUE) /*关闭调度锁，如果需要任务切换，此函数返回pdTRUE*/
      {
        taskYIELD();
      }
      //printf("UserButtonStatus = 8\r\nsuspend wwdg feed task\r\n");
      //vTaskSuspend(xHandleTaskWwdg);
    }
    else if(UserButtonStatus == 9)
    {
      printf("UserButtonStatus = 9, set vTaskLED priority to 5\r\n");
      vTaskPrioritySet(xHandleTaskLED, 5);
      printf("vTaskLED priority is now setted to %d\r\n", (int)uxTaskPriorityGet(xHandleTaskLED));
      
      printf("UserButtonStatus = 9, start tim15 for sending event\r\n");
      HAL_TIM_Base_Start_IT(&htim15);
      //printf("UserButtonStatus = 9\r\nresume wwdg feed task\r\n");
      //vTaskResume(xHandleTaskWwdg);
    }
    else if(UserButtonStatus == 10)
    {
      printf("UserButtonStatus = 10, set vTaskLED priority to 1\r\n");
      vTaskPrioritySet(xHandleTaskLED, 1);
      printf("vTaskLED priority is now setted to %d\r\n", (int)uxTaskPriorityGet(xHandleTaskLED));
      
      printf("UserButtonStatus = 10, start tim16 for sending event\r\n");
      HAL_TIM_Base_Start_IT(&htim16);
    }
    else if(UserButtonStatus == 11)
    {
      printf("UserButtonStatus = 11\r\nJumpToBootloader\r\n");
      JumpToBootLoader();
      
    }
    else
    {
      UserButtonStatus = 0;
      printf("UserButtonStatus reset to 0\r\n");
    }
    vTaskSuspend(xHandleTaskUserIF);
    vTaskDelay(20);
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskLED
* 功能说明: LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 2
*********************************************************************************************************
*/
static void vTaskLED(void *pvParameters)
{
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 1000;
  
  xLastWakeTime = xTaskGetTickCount();
  
  
  while(1)
  {
    vTaskSuspendAll(); /*开启调度锁*/
    printf("now suspend all, vTaskLED working\r\n");
    printf("xLastWakeTime = %d\r\n", xLastWakeTime);
    BSP_LED_Toggle(LED1);
    //BSP_LED_Toggle(LED2);
    //BSP_LED_Toggle(LED3);
    RTC_CalendarShow();
    
    if(xTaskResumeAll() == pdTRUE) /*关闭调度锁，如果需要任务切换，此函数返回pdTRUE*/
    {
      taskYIELD();
    }
    printf("after vTaskResumeAll\r\n");
    vTaskDelayUntil(&xLastWakeTime, xFrequency);
    
    
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskMsgPro
* 功能说明: 信息处理
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 3
*********************************************************************************************************
*/
static void vTaskMsgPro(void *pvParameters)
{
  static uint8_t frameBuffer[101] = {0};
  memset((char *)(&frameBuffer[1]), '2', 100);
  HAL_UART_Transmit_DMA(&huart6, "uart6 dma transmit success\r\n", strlen("uart6 dma transmit success\r\n"));
  //static uint8_t rcvBuf[5];
  //HAL_UART_Receive_DMA(&huart6, rcvBuf, 5);
  /* Invalidate cache prior to access by CPU */
  //SCB_InvalidateDCache_by_Addr ((uint32_t *)rcvBuf, 5);
  while(1)
  {
    //HAL_UART_Transmit_DMA(&huart7, "uart7 dma transmit success\r\n", strlen("uart6 dma transmit success\r\n"));
    uart7ModeChange(GPIOMODE);
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_7, GPIO_PIN_RESET);
    delay_us(88);
    HAL_GPIO_WritePin(GPIOF, GPIO_PIN_7, GPIO_PIN_SET);
    delay_us(8);
    uart7ModeChange(UARTMODE);
    {
      HAL_UART_Transmit(&huart7, frameBuffer, 100, 0xff);
    }
    vTaskDelay(1000);
  }
}

/*
*********************************************************************************************************
* �? �? �?: vTaskStart
* 功能说明: 启动任务，也就是�?高优先级任务，这里用�? LED 闪烁
* �? �?: pvParameters 是在创建该任务时传�?�的形参
* �? �? �?: �?
* �? �? �?: 4
*********************************************************************************************************
*/
static void vTaskStart(void *pvParameters)
{
  //uartDmaTest();
  uint8_t ucTest, *ptr8;
  uint16_t uiTest, *ptr16;
  uint32_t ulTest, *ptr32;
  PARAM_T tPara, *paraPtr;
  
  tPara.Baud485 = 0x5555AAAA;
  tPara.ParamVer = 0x99;
  tPara.ucBackLight = 0x7788;
  tPara.ucRadioMode = 99.99f;
  
  while(1)
  {
    if(UserButtonStatus == 6)
    {
      taskDISABLE_INTERRUPTS();
      eraseCpuFlash((uint32_t)para_flash_area);
      
