Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
      ucTest = 0xAA;
      uiTest = 0x55AA;
      ulTest = 0x11223344;
      
      writeCpuFlash((uint32_t)para_flash_area, (uint8_t *)&ucTest, sizeof(ucTest));
      writeCpuFlash((uint32_t)para_flash_area + 32, (uint8_t *)&uiTest, sizeof(uiTest));
      writeCpuFlash((uint32_t)para_flash_area + 32 * 2, (uint8_t *)&ulTest, sizeof(ulTest));

      /* 读出数据并打�? */
      ptr8  = (uint8_t  *)(para_flash_area + 32*0);
      ptr16 = (uint16_t *)(para_flash_area + 32*1);
      ptr32 = (uint32_t *)(para_flash_area + 32*2);

      taskENABLE_INTERRUPTS();
      printf("userButtonStatus = 6\r\n");
      printf("write data: ucTest = %x, uiTest = %x, ulTest = %x\r\n", ucTest, uiTest, ulTest);
      printf("read data: ptr8 = %x, ptr16 = %x, ptr32 = %x\r\n", *ptr8, *ptr16, *ptr32);
      vTaskSuspend(xHandleTaskStart);
    }
    else if(UserButtonStatus == 7)
    {
      printf("userButtonStatus = 7\r\n");
      /* 擦除扇区 */
      eraseCpuFlash((uint32_t)para_flash_area);
      writeCpuFlash((uint32_t)para_flash_area, (uint8_t *)&tPara, sizeof(tPara));
      
      paraPtr = (PARAM_T *)((uint32_t)para_flash_area);
      
      printf("write data: Baud485=%x, ParamVer=%x, ucBackLight=%x, ucRadioMode=%f\r\n", 
              tPara.Baud485,
              tPara.ParamVer,
              tPara.ucBackLight,
              tPara.ucRadioMode);
				
      printf("read data: Baud485=%x, ParamVer=%x, ucBackLight=%x, ucRadioMode=%f\r\n", 
              paraPtr->Baud485,
              paraPtr->ParamVer,
              paraPtr->ucBackLight,
              paraPtr->ucRadioMode);
      vTaskSuspend(xHandleTaskStart);
    }
    
    vTaskDelay(10);
  }
}

static void vTaskIwdg(void *pvParameters)
{
  /*利用vTaskDelay实现vTaskDelayUntil*/
  TickType_t xDelay, xNextTime;
  const TickType_t xFrequency =  1000;
  
  /*获取第一次唤醒时间*/
  xNextTime = xTaskGetTickCount() + xFrequency;
  
  while(1)
  {
    printf("use vTaskDelay to achieve vTaskDelayUntil(1000)\r\n");
    xDelay = xNextTime - xTaskGetTickCount();
    //计算下次唤醒时间
    xNextTime += xFrequency;
    
    if(xDelay <= xFrequency)
    {
      vTaskDelay(xDelay);
    }
  }
#if 0
    if(HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK)
    {
      printf("iwdg feed error\r\n");
    }
    else
    {
      //printf("iwdg feed success\r\n");
    }
#endif
    
  
}

static void vTaskWwdg(void *pvParameters)
{
  EventBits_t uxBits;
  const TickType_t xTicksToWait = 100  / portTICK_PERIOD_MS;  /*100ms*/
  while(1)
  {
    uxBits = xEventGroupWaitBits(xHandleEventGroup, 
                                 SET_BIT_0 | SET_BIT_1, /*等待bit0和bit1被设置*/
                                 pdTRUE,                /*退出前bit0和bit1都被清除*/
                                 pdTRUE,                /*等待bit0和bit1都被设置*/
                                 xTicksToWait);         /*等待延迟时间*/
    
    if((uxBits & (SET_BIT_0 | SET_BIT_1)) == (SET_BIT_0 | SET_BIT_1))
    {
      printf("receive event group bits: bit 0 and bit 1 was setted\r\n");
      BSP_LED_Toggle(LED2);
    }
    else
    {
      //printf("run overtime or bit not setted\r\n");
      //BSP_LED_Toggle(LED3);
    }
                                 
    vTaskDelay(1);
#if 0
    vTaskDelay(wwdgDelayNum);
    if(HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK)
    {
      printf("Wwdg feed error\r\n");
    }
    else
    {
      //printf("Wwdg feed success\r\n");
    }
#endif
    
  }
}

/*
static void vTaskRtcTimeStamp(void *pvParameters)
{
  while(1)
  {
    RTC_CalendarShow();
    vTaskDelay(1000);
  }
}
*/

static void AppTaskCreate(void)
{
  xTaskCreate(vTaskTaskUserIF,          /*任务函数*/
              "vTaskUserIF",            /*任务�?*/
              512,                      /*stack大小，单位word，也就是4字节*/
              NULL,                     /*任务参数*/
              5,                        /*任务优先�?*/
              &xHandleTaskUserIF);      /*任务句柄*/
  
  xTaskCreate(vTaskLED,          /*任务函数*/
            "vTaskLED",              /*任务�?*/
            512,                       /*stack大小，单位word，也就是4字节*/
            NULL,                      /*任务参数*/
            2,                         /*任务优先�?*/
            &xHandleTaskLED);       /*任务句柄*/
    
  xTaskCreate(vTaskMsgPro,          /*任务函数*/
          "vTaskMsgPro",            /*任务�?*/
          512,                      /*stack大小，单位word，也就是4字节*/
          NULL,                     /*任务参数*/
          3,                        /*任务优先�?*/
          &xHandleTaskMsgPro);      /*任务句柄*/
      
  xTaskCreate(vTaskStart,          /*任务函数*/
        "vTaskStart",            /*任务�?*/
        512,                      /*stack大小，单位word，也就是4字节*/
        NULL,                     /*任务参数*/
        4,                        /*任务优先�?*/
        &xHandleTaskStart);      /*任务句柄*/
  
#if 1
    xTaskCreate(vTaskIwdg,          /*任务函数*/
              "vTaskIwdg",            /*任务�?*/
              512,                      /*stack大小，单位word，也就是4字节*/
              NULL,                     /*任务参数*/
              5,                        /*任务优先�?*/
              &xHandleTaskIwdg);      /*任务句柄*/
    
    xTaskCreate(vTaskWwdg,
                "vTaskWwdg",
                512,
                NULL,
                5,
                &xHandleTaskWwdg
                );
#endif
    /*
    xTaskCreate(vTaskRtcTimeStamp,
                "vTaskRtcTimeStamp",
                512,
                NULL,
                3,
                &xHandleTaskRtcTimeStamp
                );
    */
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

