Zhuzewen2023/STM32H753FreeRTOSTemplate/Core/Src/main.c
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */
  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */
  BaseType_t xYieldRequired;
  UBaseType_t uxSavedInterruptStatus;
  if(htim->Instance == TIM17)
  {
    HAL_TIM_Base_Stop_IT(&htim17);
    uxSavedInterruptStatus = portSET_INTERRUPT_MASK_FROM_ISR(); //进入临界区
    {
      printf("HAL_TIM_PeriodElapsedCallback: enter critical area\r\n");
        printf("uxSavedInterruptStatus = %d\r\n", (int)uxSavedInterruptStatus);
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR(uxSavedInterruptStatus); //退出临界区
    printf("HAL_TIM_PeriodElapsedCallback: exit critical area\r\n");
    
    xYieldRequired = xTaskResumeFromISR(xHandleTaskLED);
    
    if(xYieldRequired == pdTRUE)
    {
      printf("ISR Yield required\r\n");
      portYIELD_FROM_ISR(xYieldRequired);
    }
    
  }
  
  if(htim->Instance == TIM15)
  {
    BaseType_t xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    
    HAL_TIM_Base_Stop_IT(&htim15);
    
    xResult = xEventGroupSetBitsFromISR(xHandleEventGroup, SET_BIT_0, &xHigherPriorityTaskWoken);
    
    if(xResult != pdFAIL)
    {
      /*消息被成功发出*/
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    
  }
  
  if(htim->Instance == TIM16)
  {
    BaseType_t xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    HAL_TIM_Base_Stop_IT(&htim16);
    
    xResult = xEventGroupSetBitsFromISR(xHandleEventGroup, SET_BIT_1, &xHigherPriorityTaskWoken);
    
    if(xResult != pdFAIL)
    {
      /*消息被成功发出*/
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
  }

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
